<?php

namespace Languages;

class Korean
{
    /**
     * 语言名称
     *
     * @var string
     */
    public static $name = '韩文';

    /**
     * 翻译信息
     *
     * @var array
     */
    public static $messages = [
        ['id' => '登录', 'value' => '로그인'],
        ['id' => '用户名或邮箱', 'value' => '사용자 이름 또는 사서함'],
        ['id' => '密码', 'value' => '암호'],
        ['id' => '返回首页', 'value' => '홈페이지로 돌아가다'],
        ['id' => '用户注册', 'value' => '사용자 등록'],

        ['id' => '设置', 'value' => '설정'],
        ['id' => '基本', 'value' => '기본'],
        ['id' => '站点名称', 'value' => '사이트 이름'],
        ['id' => '站点的名称将显示在网页的标题处', 'value' => '사이트 이름이 웹 페이지의 제목에 표시됩니다'],
        ['id' => '站点描述', 'value' => '사이트 설명'],
        ['id' => '站点描述将显示在网页代码的头部', 'value' => '사이트 설명은 웹 페이지 코드의 머리에 표시됩니다'],
        ['id' => '关键词', 'value' => '키워드'],
        ['id' => '是否允许注册', 'value' => '등록 허용 여부'],
        ['id' => '否', 'value' => '아니오'],
        ['id' => '是', 'value' => '이다'],
        ['id' => '站点默认语言', 'value' => '사이트 기본 언어'],
    ];
}
